# Вправа 1: Арифметичні оператори
#
# Завдання:
# Користувач вводить два числа. Обчисли всі основні операції: +, -, *, /, //, %, **.

a = int(input("Введи перше число: "))
b = int(input("Введи друге число: "))

print("Сума:", a + b)
print("Різниця:", a - b)
print("Добуток:", a * b)
print("Ділення:", a / b)
print("Цілочисельне ділення:", a // b)
print("Остача:", a % b)
print("Піднесення до степеня:", a ** b)

# Вправа 2: Оператори порівняння
#
# Завдання:
# Введи два числа й перевір, які з порівнянь істинні.

x = int(input("Введи перше число: "))
y = int(input("Введи друге число: "))

print("x дорівнює y:", x == y)
print("x не дорівнює y:", x != y)
print("x більше y:", x > y)
print("x менше y:", x < y)
print("x більше або дорівнює y:", x >= y)
print("x менше або дорівнює y:", x <= y)

# Вправа 3: Оператори присвоєння та логічні
#
# Завдання:
# Почни з числа 10 і за допомогою операторів змінюй його значення, комбінуючи арифметику та логіку.

num = input("Enter a number: ")
num = int(num)
print("Початкове значення:", num)

num += 5   # додаємо 5
num *= 2   # множимо на 2
num -= 4   # віднімаємо 4
print("Після змін:", num)

# логічна частина
is_large = num > 20
is_even = num % 2 == 0

print("Число більше за 20:", is_large)
print("Число парне:", is_even)