# Вправа 1: Перетворення рядка у число
#
# Користувач вводить число, але воно зчитується як рядок.
# Треба перетворити його в тип int і обчислити подвоєне значення.
#
# Приклад:
# Введіть число: 7
# Очікуваний результат:
# Подвоєне значення: 14

a=input("Enter a number:")
a=int(a)
b=a*2
print(b,"I'm win!Ha-ha-ha!")

# Вправа 2: Додавання чисел і рядків
#
# Користувач вводить два числа (як рядки).
# Програма має вивести:
# Суму цих чисел як чисел
# Об’єднання цих рядків як рядків
#
# Приклад:
#
# Введіть перше число: 4
# Введіть друге число: 5
#
# Очікуваний результат:
# Сума чисел: 9
# Об’єднання рядків: 45

a=input("Enter a number1:")
b=input("Enter a number2:")
a1=int(a)
b1=int(b)
print("The sum is",a1+b1)
print("Concatenation is",a+b)

# Вправа 3: Булеве перетворення
#
# Користувач вводить будь-яке значення.
# Програма має показати, як воно поводиться при перетворенні у тип bool.
#
# Приклад:
# Введіть значення: 0
# Очікуваний результат:
# Булеве значення: False
#
# (Підказка: у Python bool(""), bool(0) → False, решта → True.)

a=input("Enter a number:")
b=bool(a)
print(b)
