# Вправа1: Привітання користувача
# Напиши програму, яка запитує
# ім’я користувача і виводить привітання у форматі:
# Приклад:
# Введіть своє ім’я: Марія
# Результат:
# Привіт, Марія! Радий тебе бачити:)
# Підказка:
# Використай конкатенацію або f - рядок:
# print(f"Привіт, {name}! Радий тебе бачити :)")

name=input("Enter your name:")
print(f"Привіт, {name}! Радий тебе бачити :)")

# Вправа 2: Підрахунок довжини рядка
# Користувач вводить будь-який рядок.
# Програма має вивести кількість символів у ньому.
#
# Приклад:
#
# Введіть текст: Python — це круто!
#
# Результат:
# Довжина рядка: 18
# Підказка:
# Використай функцію len().

text=input("Enter your text:")
print("length of your text is ",len(text))

# Вправа 3: Робота з регістром і перевертання
# Напиши програму, яка:
# Запитує у користувача рядок.
# Виводить:
# той самий рядок великими літерами
# той самий рядок малими літерами
# рядок у зворотному порядку
# Приклад:
# Введіть рядок: Python
# Результат:
#
# Великі літери: PYTHON
#
# Малі літери: python
#
# Навпаки: nohtyP
#
# Підказка:
# .upper(), .lower() — зміна регістру
# [::-1] — перевертання рядка

text=input("Enter your text:")
print("Big symbols: ",text.upper())
print("Small symbols: ",text.lower())
print("Reverse: ",text[::-1])
