# Вправа 1: Обчислення середнього
# Напиши програму, яка запитує три числа у користувача і виводить їх середнє значення.
#
# Приклад вводу:
#
# Введіть три числа: 3, 7, 10
# Очікуваний результат:
#
# Середнє: 6.6666666667

a=float(input("Enter a number1:"))
b=float(input("Enter a number2:"))
c=float(input("Enter a number3:"))
average=(a+b+c)/3
print("The average is",average)

# Вправа 2: Обмін значень
# Напиши програму, яка міняє місцями два введені числа без використання третьої змінної.
#
# Підказка: використай властивість Python:
#
# a, b = b, a

a=float(input("Enter a number1:"))
b=float(input("Enter a number2:"))
a,b=b,a
print("The a is",a,"and b is",b)

# Вправа 3: Переведення температури

# Напиши програму, яка переводить температуру
# з градусів Цельсія у Фаренгейти.
#
# Формула:
# F=9/5*C+32
#
# Приклад:
#
# Введіть температуру у Цельсіях: 25
# Температура у Фаренгейтах: 77.0

a=float(input("Enter a Celsius temperature:"))
b=a*9/5+32
print("The Farengate temperature is",b)