# Вправа 1: Функція привітання
# Завдання:
# Створи функцію greet(name), яка друкує привітання для переданого імені.
#
def greet(name):
    print(f"Hello, {name}!")

greet("Vasyl")

# Вправа 2: Функція, що повертає суму
# Завдання:
# Напиши функцію add(a, b), яка повертає суму двох чисел.
# Потім виклич її з будь-якими числами.
#
def add(a,b):
    return a+b

add(2,3)
print(add(2,3))

# Вправа 3: Функція, що рахує довжину списку
# Завдання:
# Створи функцію list_length(lst), яка повертає, скільки елементів у списку.
#
def list_length(lst):
    return len(lst)
print(list_length([2,"sd",-8]))



# ✔️ Приклад розв’язку:
# def list_length(lst):
#     return len(lst)
#
# numbers = [10, 20, 30, 40]
# print("Довжина списку =", list_length(numbers))
# Хочеш наступну тему? Наприклад:
# 👉 Python Lambda
# 👉 Python Dictionaries
# 👉 Python Classes (OOP)
# 👉 Python Modules
#
#
#
#
# No file chosenNo file chosen
# ChatGPT може помилятися. Перевіряйте важливу інформацію.
