# Вправа 1: Перевірка числа
# Завдання:
# Користувач вводить число. Програма має перевірити, чи воно додатне.

num = float(input("Введи число: "))
is_positive = num > 0

print("Число додатне?", is_positive)
#
# Вправа 2: Перевірка віку
# Завдання:
# Запитай вік користувача і визнач, чи він має повноліття.

age = int(input("Скільки тобі років? "))
is_adult = age >= 18

print("Ти повнолітній:", is_adult)

# Вправа 3: Логічні оператори
# Завдання:
# Запитай у користувача два числа й перевір:
#
# чи обидва парні (and)
#
# чи хоча б одне парне (or)

a = int(input("Введи перше число: "))
b = int(input("Введи друге число: "))

both_even = (a % 2 == 0) and (b % 2 == 0)
one_even = (a % 2 == 0) or (b % 2 == 0)

print("Обидва парні:", both_even)
print("Хоча б одне парне:", one_even)