# Вправа 1: Лічильник від 1 до 10
#
# Завдання:
# Виведи числа від 1 до 10 за допомогою циклу while .

i=0
while i < 10:
    i+=1
    print(i)

# Вправа 2: Пароль користувача
#
# Завдання:
# Попроси користувача ввести пароль.
# Поки він не введе "python123", програма повинна повторювати запит.

passwd=input("Enter your password: ")
while passwd != "python123":
    passwd=input("Enter your password: ")

# Вправа 3: Сума чисел, поки не 0
#
# Завдання:
# Користувач вводить числа. Програма підсумовує їх, поки не введено 0.
# Коли користувач вводить 0, програма показує загальну суму.

summ=0
n=int(input("Enter your number: "))
while n != 0:
    summ+=n
    n=int(input("Enter your number: "))

print(summ)
