# Вправа 1: Підрахунок товарів
# Завдання:
# Є список покупок. Порахуйте, скільки разів зустрічається кожен товар.
#
# items = ["яблуко", "банан", "яблуко", "груша", "банан", "яблуко"]
#
# Очікуваний результат:
#
# {"яблуко": 3, "банан": 2, "груша": 1}
# Підказка: використай dict або collections.Counter.
items = ["яблуко", "банан", "яблуко", "груша", "банан", "яблуко"]
counts = {}
for item in items:
    counts[item] = counts.get(item, 0) + 1

print(counts)

# Вправа 2: Перевертання словника
# Завдання:
# Дано словник, де ключ — це ім’я, а значення — вік.
# Створіть новий словник, де ключ — вік, а значення — список імен із цим віком.

people = {"Анна": 25, "Іван": 30, "Марія": 25, "Петро": 20}

reversed_dict = {}
for name, age in people.items():
    reversed_dict.setdefault(age, []).append(name)

print(reversed_dict)

# Очікуваний результат:
#
# {25: ["Анна", "Марія"], 30: ["Іван"], 20: ["Петро"]}
# Вправа 3: Об’єднання двох словників із сумуванням значень
# Завдання:
# Є два словники з кількістю проданих товарів. Об’єднай їх так, щоб значення однакових ключів додавалися.

sales1 = {"яблуко": 10, "банан": 5, "груша": 2}
sales2 = {"яблуко": 3, "груша": 4, "апельсин": 7}

total_sales = sales1.copy()
for fruit, count in sales2.items():
    total_sales[fruit] = total_sales.get(fruit, 0) + count
print(total_sales)

# Очікуваний результат:
#
# {"яблуко": 13, "банан": 5, "груша": 6, "апельсин": 7}
# Підказка: можна використати цикл або collections.Counter.
