# Вправа 1: Виведи числа від 1 до 10
#
# Завдання:
# Використай цикл for, щоб надрукувати всі числа від 1 до 10.

for i in range(1,11):
    print(i)

# Вправа 2: Квадрати чисел
#
# Завдання:
# Створи цикл, який виводить квадрат кожного числа від 1 до 5.

for i in range(1,6):
    print(i**2)

# Вправа 3: Перебір списку і підрахунок
#
# Завдання:
# Є список імен. Надрукуй привітання для кожного і порахуй, скільки імен у списку.

lis=["was","er","fyh","rgh","erf"]
i=0
for word in lis:
    print(f"Hello, {word}!")
    i+=1

print("There are ",i," words in total.")