# Вправа 1: Унікальні елементи списку
# Завдання:
# Дано список чисел. Знайди, скільки в ньому унікальних елементів.

numbers = [1, 2, 2, 3, 4, 4, 5, 1]
unique_numbers = set(numbers)
print("Кількість унікальних чисел:", len(unique_numbers))

# Очікуваний результат:
#
# Кількість унікальних чисел: 5
# Вправа 2: Спільні елементи двох множин
# Завдання:
# Є два набори учнів, які відвідують різні гуртки. Знайди тих, хто ходить у обидва гуртки.

math_club = {"Оля", "Ігор", "Максим", "Марія"}
art_club = {"Марія", "Андрій", "Максим", "Софія"}
both_clubs = math_club & art_club # або math_club.intersection(art_club)
print("Учні, які відвідують обидва гуртки:", both_clubs)

# Учні, які відвідують обидва гуртки: {'Марія', 'Максим'}
# Вправа 3: Унікальні слова в реченні
# Завдання:
# Порахуй кількість унікальних слів у реченні (ігноруючи регістр).
#
sentence = "Python is fun and python is powerful"
unique_words = set(sentence.split(" "))
print("Унікальні слова:", unique_words)
print("Кількість:", len(unique_words))
# ✅ Очікуваний результат:
#
# Унікальні слова: {'python', 'is', 'fun', 'and', 'powerful'}
# Кількість: 5