# Вправа 1: “Розкоментуй код”

# Завдання:
# Тобі дано фрагмент коду, у якому всі #рядки закоментовані.
# Розкоментуй потрібні рядки, щоб #програма вивела "Hello, Python!"

# message = "Hello"
# name = "Python"
# print(message + " " + name + "!")

message = "Hello"
name = "Python"
print(message + " " + name + "!")

# Вправа 2: “Коментарі як підказки”

# Завдання:
# Додай коментарі, щоб пояснити роботу #програми.

x = 5
y = 3
z = x ** y
print(z)

x = 5  # основа (число, яке будемо підносити до степеня)
y = 3  # показник степеня
z = x ** y  # обчислюємо 5 у 3 степені (тобто 5 * 5 * 5)
print(z)  # виводимо результат: 125


# Вправа 3: “Коментар чи рядок коду?”

# Це коментар. Python його ігнорує.
def area(width, height):  # це визначення функції (код)
    """Повертає площу прямокутника."""  # це докстрінг — документація до функції
    return width * height  # це код із коментарем у кінці


# викликаємо функцію з аргументами 4 і 5, отримаємо результат 20
print(area(4, 5))
