# Вправа 1: Проста математика
#
# Завдання:
# Створи змінні a і b, задай їм числа, і обчисли суму, різницю, добуток і частку.

a=3
b=6
sum=a+b
dif=a-b
mul=a*b
div=a/b
print("Summa is ",sum)
print("Difference is ",dif)
print("Multiplication is ",mul)
print("Division is ",div)

# Вправа 2: Обмін значень
#
# Завдання:
# Є дві змінні x і y. Поміняй їхні значення місцями.

x = 5
y = 10

print("До обміну: x =", x, ", y =", y)

# обмін значень
x, y = y, x

print("Після обміну: x =", x, ", y =", y)

# Вправа 3: Інформація про користувача
#
# Завдання:
# Запитай у користувача ім’я, вік і місто, а потім виведи коротке повідомлення.

name = input("Введи своє ім'я: ")
age = input("Скільки тобі років? ")
city = input("З якого ти міста? ")

print(f"Привіт, {name}! Тобі {age} років і ти з міста {city}.")
