#Вправа 1: Привітання користувача

#Завдання:
#Напиши програму, яка запитує ім’я користувача і виводить повідомлення:

#“Привіт, [ім’я]!”
nam=input("What's your name?")
print(f"Hello, {nam}!")

#Вправа 2: Перевірка віку

#Завдання:
#Створи програму, яка запитує в користувача його вік і видає різні #повідомлення залежно від того, скільки йому років.
age=int(input("What is your age?"))
if age<=20:
	print("Hello, kid!")
elif age<60:
	print("Hello, middle-aged pupil!")
else:
    print("Diembel v maju, vsio po kuju!")

#Вправа 3: Підрахунок парних і непарних чисел

#Завдання:
#Напиши програму, яка запитує у користувача 5 чисел і рахує, скільки з них парні, а скільки непарні.

even = 0
odd = 0

for i in range(5):
    num = int(input(f"Введи число {i+1}: "))
    if num % 2 == 0:
        even += 1
    else:
        odd += 1

print(f"Парних чисел: {even}")
print(f"Непарних чисел: {odd}")
